eis-cart-tests-master@3bc714a7387/tests/test-data/dmp-interfaces/Process_Files/template/request.xmlt

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:even='http://www.thegoldensource.com/EventRaiserService.wsdl'>
	<soapenv:Header/>
	<soapenv:Body>
		<even:RaiseProcessFilesDirectoryAsynchron>
			<even:BusinessFeed>${BUSINESS_FEED}</even:BusinessFeed>
			<even:Directory>${INBOUND_PATH}</even:Directory>
			<even:FileLoadEvent>StandardFileLoad</even:FileLoadEvent>
			<even:FilePatterns>${FILE_PATTERN}</even:FilePatterns>
			<even:MessageBulkSize>2000</even:MessageBulkSize>
			<even:MessageProcessingEvent>ProcessFeedMessage</even:MessageProcessingEvent>
			<even:MessageType>${MESSAGE_TYPE}</even:MessageType>
			<even:NrOfFilesParallel>1</even:NrOfFilesParallel>
			<even:OutputDirectory>${ARCHIVE_PATH}</even:OutputDirectory>
			<even:ParallelBranches>2</even:ParallelBranches>
			<even:Price_BLANK_Point_BLANK_Event_BLANK_Definition_BLANK_Id>${PRICE_POINT_EVENT_DEF_ID!}</even:Price_BLANK_Point_BLANK_Event_BLANK_Definition_BLANK_Id>
			<even:ReProcessProcessedFiles>true</even:ReProcessProcessedFiles>
			<even:SuccessAction>DELETE</even:SuccessAction>
		</even:RaiseProcessFilesDirectoryAsynchron>
	</soapenv:Body>
</soapenv:Envelope>